import turtle as t

print("Выберите фигуру")
print("Если хотите отрезок, введите: а")
print("Если хотите прямоугольник, введите: б")
print("Если хотите круг, введите: в")
print("Если хотите равносторонний треугольник, введите: г")

f = input("Ввод: ")
if f not in 'абвг' or len(f) != 1:
    raise TypeError("Вы можете ввести только буквы 'а', 'б', 'в' или 'г'")

if f == 'а':
    print("Координаты должны быть в диапазоне: (-350 <= x <= 350, -300 <= y <= 300)")
    t1 = [int(j) for j in input("Введите координаты первой точки: ").split()]
    if t1[0] > 350 or t1[0] < -350 or t1[1] > 300 or t1[1] < -300:
        raise TypeError("Координаты должны быть в диапазоне: (-350 <= x <= 350, -300 <= y <= 300)")
    t2 = [int(j) for j in input("Введите координаты второй точки: ").split()]
    if t2[0] > 350 or t2[0] < -350 or t2[1] > 300 or t2[1] < -300:
        raise TypeError("Координаты должны быть в диапазоне: (-350 <= x <= 350, -300 <= y <= 300)")
    t.speed(50)
    t.up()
    t.color("black")
    t.goto(t1[0], t1[1])
    t.down()
    t.goto(t2[0], t2[1])

if f == 'б':
    print("Координаты должны быть в диапазоне: (-350 <= x <= 350, -300 <= y <= 300)")
    t1 = [int(j) for j in input("Введите координаты первой вершины: ").split()]
    if t1[0] > 350 or t1[0] < -350 or t1[1] > 300 or t1[1] < -300:
        raise TypeError("Координаты должны быть в диапазоне: (-350 <= x <= 350, -300 <= y <= 300)")
    t2 = [int(j) for j in input("Введите координаты второй вершины: ").split()]
    if t2[0] > 350 or t2[0] < -350 or t2[1] > 300 or t2[1] < -300:
        raise TypeError("Координаты должны быть в диапазоне: (-350 <= x <= 350, -300 <= y <= 300)")
    if t1[0] == t2[0] or t1[1] == t2[1]:
        raise TypeError("Прямоугольник не построить по таким координатам")
    t.speed(50)
    t.up()
    t.color("black")
    t.goto(t1[0], t1[1])
    t.down()
    t.goto(t2[0], t1[1])
    t.goto(t2[0], t2[1])
    t.goto(t1[0], t2[1])
    t.goto(t1[0], t1[1])

if f == 'в':
    print("Координаты должны быть в диапазоне: (-350 <= x <= 350, -300 <= y <= 300)")
    t1 = [int(j) for j in input("Введите координаты центра окружности: ").split()]
    if t1[0] > 350 or t1[0] < -350 or t1[1] > 300 or t1[1] < -300:
        raise TypeError("Координаты должны быть в диапазоне: (-350 <= x <= 350, -300 <= y <= 300)")
    t2 = int(input("Введите значение радиуса: "))
    if (t2 + abs(t1[0])) > 350 or (t2 + abs(t1[1])) > 300:
        raise TypeError("Недопустимое значение радиуса для данной координаты центра")
    if t2 < 0:
        raise TypeError("Радиус не может быть отрицательным")
    t.speed(50)
    t.up()
    t.color("black")
    t.goto(t1[0], t1[1])
    t.down()
    t.circle(t2)

if f == 'г':
    print("Координаты должны быть в диапазоне: (-350 <= x <= 350, -300 <= y <= 300)")
    t1 = [int(j) for j in input("Введите координаты вершины треугольника: ").split()]
    if t1[0] > 350 or t1[0] < -350 or t1[1] > 300 or t1[1] < -300:
        raise TypeError("Координаты должны быть в диапазоне: (-350 <= x <= 350, -300 <= y <= 300)")
    t2 = int(input("Введите значение высоты: "))
    a = (t2 * 2 / (3 ** 0.5))
    if (a + abs(t1[0])) > 350 or (a + abs(t1[1])) > 300:
        raise TypeError("Недопустимое значение высоты для данной координаты вершины")
    if a < 0:
        raise TypeError("Высота не может быть отрицательной")
    t.speed(50)
    t.up()
    t.color("black")
    t.goto(t1[0], t1[1])
    t.down()
    t.forward(a)
    t.left(120)
    t.forward(a)
    t.left(120)
    t.forward(a)

t.mainloop()
